const exSwitch = (value) => {
    const map = {
        1 : "한식",
        2 : "양식",
        3 : "일식",
        4 : "중식",
        5 : "분식/치킨",
        6 : "아시아",
        7 : "퓨전 음식",
        8 : "뷔페",
        9 : "레스토랑",
        10 : "카페",
        11 : "술집",
        12 : "숙박",
        13 : "체험/관광",
        14 : "동물과 함께",
        15 : "아이와 함께",
        16 : "클래스/소품",
        17 : "테마파크",
        18 : "레저/엑티비티",
        19 : "문화예술",
        20 : "역사유적",
        21 : "캠핑",
        22 : "공원",
        23 : "물놀이",
        24 : "자연명소",
        25 : "낚시",
        26 : "쇼핑몰",
        27 : "병원",
        28 : "헤어/미용/뷰티"
    }
    return map[value]?? "기타";
}